import pandas as pd
import matplotlib.pyplot as plt
import matplotlib.font_manager as fm
# 定义数据
data = [
    ["18-24岁", "男", "学生", "经常", "学业", "是", "是", "减少工作量", "是"],
    ["18岁以下", "女", "学生", "经常", "学业", "是", "是", "增加薪资", "是"],
    ["25-32岁", "男", "员工", "偶尔", "工作", "否", "是", "减少工作量", "是"],
    ["33岁以上", "男", "个体", "偶尔", "家庭", "否", "否", "增加薪资", "是"],
    ["18岁以下", "男", "学生", "从不", "学业", "否", "否", "减少工作量", "是"],
    ["33岁以上", "女", "无业", "经常", "社交", "否", "是", "增加薪资", "否"],
    ["18-24岁", "女", "学生", "偶尔", "家庭", "是", "是", "增加薪资", "否"],
    ["18-24岁", "女", "员工", "从不", "社交", "否", "是", "增加薪资", "是"],
    ["25-32岁", "男", "学生", "经常", "学业", "否", "是", "增加薪资", "是"],
    ["33岁以上", "女", "员工", "经常", "工作", "是", "否", "减少工作量", "是"],
    ["33岁以上", "男", "员工", "经常", "工作", "否", "是", "增加薪资", "是"],
    ["18-24岁", "女", "学生", "从不", "社交", "否", "是", "增加薪资", "是"],
    ["18岁以下", "男", "无业", "偶尔", "家庭", "是", "否", "增加薪资", "是"],
    ["33岁以上", "男", "个体", "偶尔", "工作", "是", "是", "减少工作量", "否"],
    ["25-32岁", "女", "个体", "经常", "社交", "否", "是", "增加薪资", "是"],
    ["25-32岁", "男", "员工", "偶尔", "工作", "是", "否", "增加薪资", "是"],
    ["18-24岁", "男", "学生", "经常", "学业", "是", "是", "减少工作量", "是"],
    ["18-24岁", "女", "学生", "经常", "学业", "是", "是", "增加薪资", "是"],
    ["25-32岁", "女", "员工", "从不", "家庭", "否", "是", "增加薪资", "是"],
    ["18岁以下", "女", "学生", "偶尔", "学业", "否", "否", "减少工作量", "是"]
]
# 指定字体
plt.rcParams['font.family'] = 'Microsoft YaHei'
columns = ['年龄', '性别', '职业', '最近是否感到有压力', '压力的主要来源', '是否会通过社交来缓解压力', '公开表达观点时是否会感到压力', '让你更能缓解压力的补偿方式', '对于用于放松的社会设施是否满意']
colors = ['#63b2ee', '#76da91', '#f8cb7f', '#f89588', '#7cd6cf', '#9192ab']
# 创建DataFrame
df = pd.DataFrame(data, columns=columns)

# 遍历每一列并绘制饼图
for column in df.columns:
    # 计算各分类的数量
    value_counts = df[column].value_counts()
    
    # 绘制饼图
    plt.figure()
    plt.pie(value_counts, labels=value_counts.index,colors=colors[:len(value_counts)], autopct='%1.1f%%')
    plt.title(f'{column}')
    plt.show()